"Display settings" = "Display settings"
"Show File Extensions" = "Show File Extensions"
"Maintenance (next launch only)" = "Maintenance (next launch only)"
"Remove Cached Files" = "Remove Cached Files"
